/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：用递归函数P(n,x)实现勒让德多项式(参考图1、).

--------------------------------------------------------------------------------
注意：
1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
  和*end*所标记的区域内完成题干要求的函数功能。
2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
------------------------------------------------------------------------------*/
#include <iomanip>
#include <iostream>
using namespace std;

/*********Program*********/
double P(double m, int n)
{
    if (n == 0)
        return 1;
    else if (n == 1)
        return m;
    else if (n > 1)
        return ((2 * n - 1) * m * P(m, n - 1) - (n - 1) * P(m, n - 2)) / n;
}

/*********  End  *********/

// 忽略阅读
int main()
{
    int n;
    double m;
    cin >> m >> n;
    cout << setiosflags(ios::fixed) << setprecision(2);
    cout << P(m, n);

    return 0;
}
// 忽略阅读结束
